<a href="https://colab.research.google.com/github/alexb523/projects_for_school/blob/master/count_by_group.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

d = {'id': [1, 2, 3], 'col1': ['a', 'b', 'c'], 'col2': ['b', 'b', 'a']}
df = pd.DataFrame(data=d)
df

   id col1 col2
0   1    a    b
1   2    b    b
2   3    c    a

In [2]:
df_melt = pd.melt(df, id_vars=['id'], value_vars=['col1', 'col2'])
df_melt

   id variable value
0   1     col1     a
1   2     col1     b
2   3     col1     c
3   1     col2     b
4   2     col2     b
5   3     col2     a

In [5]:
df_melt['value'].value_counts()

b    3
a    2
c    1
Name: value, dtype: int64